* Differences between versions

Right now I'm putting everything in separate files.

=<dict_id> - <old version>-<new version> - <added|removed>.json=

Use =./do.el=.

- It requires my [[https://github.com/kisaragi-hiu/set.el][set.el]], which is a first-in-first-out (like JavaScript) set implementation based on combining a hash table and a list (to maintain order).
- Right now you have to fill in the version numbers manually.

#+begin_src sh
cask install
#+end_src

#+begin_src emacs-lisp
(require 'notifications)
(load-file "./do.el")
(pcase-dolist (`(,dict ,old-version ,new-version)
               '(("dict_concised" "2014_20240821" "2014_20241226")
                 ("dict_idioms"   "2020_20240627" "2020_20241226")
                 ("dict_mini"     "2019_20240626" "2019_20241223")
                 ("dict_revised"  "2015_20240904" "2015_20241225")))
  (d:generate-diff dict
    :old-commit "fac4c58"
    :new-commit "040c91d"
    :old-version old-version
    :new-version new-version))

(notifications-notify :body "Done")
#+end_src

#+RESULTS:
: 3
